examples/03-room/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 291;

boundaryField
{
    floor
    {
        type            regulatedTemperature;
        q               80;
        kappa           0.6;
        regulator
        {
            sensor
            {
                field       T;
                type        points;
                points
                (
                    (5.0 4.5 5.0)
                    (5.5 4.5 5.0)
                    (4.5 4.5 5.0)
                );
            }
            targetValue 293;
            mode        twoStep;
            parameters
            {
                h           2;
            }
        }
    }

    ceiling
    {
        type            lumpedMassWallTemperature;
        kappaMethod     fluidThermo;
        kappa           none;
        mass            1000;
        Cp              4100;
        value           uniform 293;
    }

    walls
    {
        type            fixedGradient;
        gradient        uniform -30;
    }
}


// ************************************************************************* //
