examples/03-room/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
#------------------------------------------------------------------------------

blockMesh

buoyantPimpleFoam

#------------------------------------------------------------------------------
